In [1]:
# Zachary Walsh
# pandas.ipynb
# Series of Pandas Series demonstrations
# Last edited July 17, 2023

# required imports
import numpy as np
import pandas as pd

In [2]:
# creating a new series
labels = ['a', 'b', 'c']
my_list = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a':10, 'b':20, 'c':30}

# create series with pd.Series() function
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [3]:
# use arguments to assign labels
pd.Series(my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [4]:
Series = pd.Series(my_list, index=labels)
Series[0]
# Should return 10
Series['a']
# Should return 10

10

In [6]:
# See first cell for meaning of below
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [7]:
# use built-in functions 'without error'
pd.Series([sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [9]:
# DataFrame usage follows

#create lists for rows and columns
rows = ['X','Y','Z']
cols = ['A','B','C','D','E']

#create array that holds the data
data = np.round(np.random.randn(3,5),2)

#"Wrap up constituent variables"
pd.DataFrame(data, rows, cols)

      A     B     C     D     E
X -2.50  0.79  0.55  0.50  0.15
Y  0.61 -0.16 -0.90  0.71 -1.81
Z -1.59  0.50 -0.88 -0.94 -3.02

In [11]:
#Indexing and assignment
df = pd.DataFrame(data,rows,cols)
df['A']

X   -2.50
Y    0.61
Z   -1.59
Name: A, dtype: float64

In [12]:
df['E']

X    0.15
Y   -1.81
Z   -3.02
Name: E, dtype: float64

In [15]:
# Create and remove columns
df['A + B'] = df['A'] + df['B']
df

      A     B     C     D     E  A + B
X -2.50  0.79  0.55  0.50  0.15  -1.71
Y  0.61 -0.16 -0.90  0.71 -1.81   0.45
Z -1.59  0.50 -0.88 -0.94 -3.02  -1.09

In [17]:
df.drop('A + B', axis=1)
df

      A     B     C     D     E  A + B
X -2.50  0.79  0.55  0.50  0.15  -1.71
Y  0.61 -0.16 -0.90  0.71 -1.81   0.45
Z -1.59  0.50 -0.88 -0.94 -3.02  -1.09

In [18]:
# Select a row from the DataFrame section

#access with loc attribute
df.loc['X']

A       -2.50
B        0.79
C        0.55
D        0.50
E        0.15
A + B   -1.71
Name: X, dtype: float64

In [19]:
# access via numerical index with iloc attribute
df.iloc[0]

A       -2.50
B        0.79
C        0.55
D        0.50
E        0.15
A + B   -1.71
Name: X, dtype: float64

In [20]:
# Determine number of rows/columnds using shape
df.shape
# should return (3,5) unless the column I added changes that

(3, 6)

In [21]:
# slicing DataFrames
df[['A', 'B']]
df[['A', 'B']].loc[['X','Y']]

      A     B
X -2.50  0.79
Y  0.61 -0.16

In [22]:
# only display frames above .5
df[df > 0.5]

      A     B     C     D   E  A + B
X   NaN  0.79  0.55   NaN NaN    NaN
Y  0.61   NaN   NaN  0.71 NaN    NaN
Z   NaN   NaN   NaN   NaN NaN    NaN

In [23]:
# show subset of frame where value in clumn C is less than 1
df['C'] < 1

X    True
Y    True
Z    True
Name: C, dtype: bool

In [24]:
# Return subsets that satisfy very specific requirements, or none in my case (numbers are randomly generated)
df[(df['C'] > 0) & (df['A']> 0)]

Empty DataFrame
Columns: [A, B, C, D, E, A + B]
Index: []

In [25]:
# Modify index of a DataFrame
df.reset_index()

  index     A     B     C     D     E  A + B
0     X -2.50  0.79  0.55  0.50  0.15  -1.71
1     Y  0.61 -0.16 -0.90  0.71 -1.81   0.45
2     Z -1.59  0.50 -0.88 -0.94 -3.02  -1.09

In [26]:
# Rename columns in following cell
df.columns

Index(['A', 'B', 'C', 'D', 'E', 'A + B'], dtype='object')

In [28]:
df.columns = [1,2,3,4,5,6]
df

      1     2     3     4     5     6
X -2.50  0.79  0.55  0.50  0.15 -1.71
Y  0.61 -0.16 -0.90  0.71 -1.81  0.45
Z -1.59  0.50 -0.88 -0.94 -3.02 -1.09

In [29]:
df = pd.DataFrame(np.array([[1, 5, 1],[2, np.nan, 2],[np.nan, np.nan, 3]]))
df.columns = ['A', 'B', 'C']
df

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  3.0

In [30]:
df.dropna()

     A    B    C
0  1.0  5.0  1.0

In [31]:
df.dropna(axis=1)

     C
0  1.0
1  2.0
2  3.0

In [33]:
# Replace NaN value with an emoji
df.fillna('ðŸ¤¢')

     A    B    C
0  1.0  5.0  1.0
1  2.0    ðŸ¤¢  2.0
2    ðŸ¤¢    ðŸ¤¢  3.0

In [34]:
# Fill missing values with means (averages)
df.fillna(df.mean())

     A    B    C
0  1.0  5.0  1.0
1  2.0  5.0  2.0
2  1.5  5.0  3.0

In [35]:
# "GroupBy" Section
df = pd.DataFrame([ ['Google', 'Sam', 200],
                    ['Google', 'Charlie', 120],
                    ['Salesforce','Ralph', 125],
                    ['Salesforce','Emily', 250],
                    ['Adobe','Rosalynn', 150],
                    ['Adobe','Chelsea', 500]])
df.columns = ['Organization', 'Salesperson Name', 'Sales']
df
# I think it might make more sense to assign columns first, personally

  Organization Salesperson Name  Sales
0       Google              Sam    200
1       Google          Charlie    120
2   Salesforce            Ralph    125
3   Salesforce            Emily    250
4        Adobe         Rosalynn    150
5        Adobe          Chelsea    500

In [36]:
df.groupby('Organization')\
# An obscure message means it's successful

In [37]:
# Using 'describe' method
df.groupby('Organization').describe()

             Sales
             count   mean         std    min     25%    50%     75%    max
Organization
Adobe          2.0  325.0  247.487373  150.0  237.50  325.0  412.50  500.0
Google         2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Salesforce     2.0  187.5   88.388348  125.0  156.25  187.5  218.75  250.0

In [38]:
# Merging pandas
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],

                        'B': ['B0', 'B1', 'B2', 'B3'],

                        'C': ['C0', 'C1', 'C2', 'C3'],

                        'D': ['D0', 'D1', 'D2', 'D3']},

                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],

                        'B': ['B4', 'B5', 'B6', 'B7'],

                        'C': ['C4', 'C5', 'C6', 'C7'],

                        'D': ['D4', 'D5', 'D6', 'D7']},

                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],

                        'B': ['B8', 'B9', 'B10', 'B11'],

                        'C': ['C8', 'C9', 'C10', 'C11'],

                        'D': ['D8', 'D9', 'D10', 'D11']},

                        index=[8, 9, 10, 11])

In [39]:
str1 = 'Hello '
str2 = 'World!'
str1 + str2

'Hello World!'

In [40]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [41]:
# merge method section
leftDataFrame = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],

                     'A': ['A0', 'A1', 'A2', 'A3'],

                     'B': ['B0', 'B1', 'B2', 'B3']})

   

rightDataFrame = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],

                          'C': ['C0', 'C1', 'C2', 'C3'],

                          'D': ['D0', 'D1', 'D2', 'D3']})

In [42]:
# Merge the two DataFrames
pd.merge(leftDataFrame, rightDataFrame, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [43]:
# Join method
leftDataFrame = pd.DataFrame({  'A': ['A0', 'A1', 'A2', 'A3'],

                                'B': ['B0', 'B1', 'B2', 'B3']},

                                index =['K0', 'K1', 'K2', 'K3'])

   

rightDataFrame = pd.DataFrame({ 'C': ['C0', 'C1', 'C2', 'C3'],

                                'D': ['D0', 'D1', 'D2', 'D3']},

                                index = ['K0', 'K1', 'K2', 'K3'])

In [44]:
leftDataFrame.join(rightDataFrame)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [45]:
# Other operations
df = pd.DataFrame({'col1':['A','B','C','D'],

                   'col2':[2,7,3,7],

                   'col3':['fgh','rty','asd','qwe']})

In [46]:
# Find unique values
df['col2'].unique()

array([2, 7, 3], dtype=int64)

In [47]:
# Display number of unique values
df['col2'].nunique()

3

In [48]:
# Count occurrences of each value in a series
df['col2'].value_counts()

7    2
2    1
3    1
Name: col2, dtype: int64

In [49]:
# Apply method section

# Define exp
def exponentify(x):

    return x**x

df['col2'].apply(exponentify)

0         4
1    823543
2        27
3    823543
Name: col2, dtype: int64

In [50]:
# Sorting the frame
df.sort_values('col2')

  col1  col2 col3
0    A     2  fgh
2    C     3  asd
1    B     7  rty
3    D     7  qwe

In [51]:
# Export DataFrames as CSVs
df = pd.DataFrame(np.random.randn(50,3))
df.to_csv('my_csv.csv')

In [53]:
# Export .json files with Pandas
df.to_json('my_new_json.json')

In [ ]:
# Export to .xlsx with Pandas
df.to_excel('my_new_excel_file.xlsx')